# Exercise: Analyzing Chinook Database

Preparation I've done:
 - Retrieve the dataset and load it
 - Load the %sql extension and point it at the database
 - Display the tables and an example query

Additional steps you might take:
 - Add libraries for visualization (matplotlib, seaborn, plotly)
 - Add libraries for statistics (numpy)
 - Explore the dataset using SQL and/or pandas

----

1. Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. Limit the result to the first 5 rows.
   > Operations: `SELECT`
2. Find the total number of customers from each country. Display the country name and the corresponding count. Order the results by the count in descending order.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
3. Identify the top 5 genres with the highest number of tracks. Display the genre name along with the total number of tracks for each genre.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
4. Determine the average invoice total for each customer, considering both the album and individual track purchases. Display the customer's first and last name along with the average invoice total. Order the results by the average invoice total in descending order.
   > Operations: `SELECT`, `AVG`, `JOIN`, `GROUP BY`, `ORDER BY`
5. Identify the customer who spent the most on music purchases. Display the customer's first and last name, along with the total amount spent.
   > Operations: `SELECT`, `SUM`, `JOIN`, `GROUP BY`, `ORDER BY`, `LIMIT`

In [1]:
# Load chinook dataset and query it using SQL magic into pandas dataframes
%pip install pandas

import pandas as pd

# Install ipython-sql if not already installed
%pip install ipython-sql

# Load SQL extension
%load_ext sql

# Import sqlite3
import sqlite3

# Load data
conn = sqlite3.connect("chinook.sqlite")

# Tell %sql about the database
%sql sqlite:///chinook.sqlite

# List tables in database
query = "SELECT name FROM sqlite_master WHERE type='table';"

# Read data into a Pandas DataFrame
tables = %sql $query

# Print head
display(tables)

# Query to get the first 5 rows of the `albums` table
result = %sql SELECT * FROM albums LIMIT 5;

# Display query result, note that Pandas DataFrame is returned!
display(result)

%config SqlMagic.autopandas= True
%config SqlMagic.displaycon = False

Requirement already satisfied: pandas in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.23.2 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from pandas) (1.25.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3.1 -> 23.3.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

/var/folders/k2/h7t5byyn0_sc57mcln13ql6w0000gn/T/ipykernel_68712/4017403733.py:4: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

Requirement already satisfied: ipython-sql in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (8.20.0)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (2.0.25)
Requirement already satisfied: sqlparse in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: decorator in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (2.17.2)
Requirement already satisfied: stack-data in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (5.14.1)
Requirement already satisfied: pexpect>4.3 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /Users/katherinecole/datasci_223/.venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

[notice] A new release of pip is available: 23.3.1 -> 23.3.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.
 * sqlite:///chinook.sqlite
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

 * sqlite:///chinook.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [2]:
#1. Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. 
#Limit the result to the first 5 rows.

  # > Operations: `SELECT`

track_list2= %sql SELECT Name, Albumid FROM tracks \
LIMIT 5;
display (track_list2)

Done.

                                      Name  AlbumId
0  For Those About To Rock (We Salute You)        1
1                        Balls to the Wall        2
2                          Fast As a Shark        3
3                        Restless and Wild        3
4                     Princess of the Dawn        3

In [3]:
#Extra steps to build on question #1.


#I then decided to build on question #1 by displaying the album NAME instead of the ID
#This requires a join, as Album name is in the albums table, wheras the track name is in the tracks table

#We note here that all of the tracks are coming from the same album, which is in contrast to the first part of the exercise

track_list= %sql SELECT tracks.Name AS Track_Name, albums.Title AS Album_Name \
FROM tracks \
JOIN albums ON tracks.Albumid=albums.Albumid \
LIMIT 5;

display (track_list)

Done.

,Track_Name,Album_Name
0,For Those About To Rock (We Salute You),For Those About To Rock We Salute You
1,Put The Finger On You,For Those About To Rock We Salute You
2,Let's Get It Up,For Those About To Rock We Salute You
3,Inject The Venom,For Those About To Rock We Salute You
4,Snowballed,For Those About To Rock We Salute You

In [4]:

 #If we group by album ID and extend the number of observations, we are able to get a list of tracks from each album

track_list= %sql SELECT tracks.Name AS Track_Name, tracks.AlbumId, albums.Title AS Album_Name \
FROM tracks \
JOIN albums ON tracks.Albumid=albums.Albumid \
GROUP BY tracks.AlbumId \
LIMIT 20;

display (track_list)

Done.

,Track_Name,AlbumId,Album_Name
0,For Those About To Rock (We Salute You),1,For Those About To Rock We Salute You
1,Balls to the Wall,2,Balls to the Wall
2,Fast As a Shark,3,Restless and Wild
3,Go Down,4,Let There Be Rock
4,Walk On Water,5,Big Ones
5,All I Really Want,6,Jagged Little Pill
6,We Die Young,7,Facelift
7,Desafinado,8,Warner 25 Anos
8,Enter Sandman,9,Plays Metallica By Four Cellos
9,Cochise,10,Audioslave
10,Your Time Has Come,11,Out Of Exile
11,Money,12,BackBeat Soundtrack
12,Quadrant,13,The Best Of Billy Cobham
13,Intro/ Low Down,14,Alcohol Fueled Brewtality Live! [Disc 1]
14,Heart Of Gold,15,Alcohol Fueled Brewtality Live! [Disc 2]
15,Black Sabbath,16,Black Sabbath
16,Wheels Of Confusion / The Straightener,17,Black Sabbath Vol. 4 (Remaster)
17,Smoked Pork,18,Body Count
18,King In Crimson,19,Chemical Wedding
19,First Time I Met The Blues,20,The Best Of Buddy Guy - The Millenium Collection

In [5]:
#2. Find the total number of customers from each country. 
#Display the country name and the corresponding count. 
#Order the results by the count in descending order.
   #> Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`

#Create a new label for the customer count, specify the main table, Want to order by the customer count

cust_nation = %sql SELECT Country, COUNT(CustomerId) AS Num_Customers\
FROM customers\
GROUP BY Country\
ORDER BY Num_Customers DESC;

display(cust_nation)

Done.

           Country  Num_Customers
0              USA             13
1           Canada              8
2           France              5
3           Brazil              5
4          Germany              4
5   United Kingdom              3
6         Portugal              2
7            India              2
8   Czech Republic              2
9           Sweden              1
10           Spain              1
11          Poland              1
12          Norway              1
13     Netherlands              1
14           Italy              1
15         Ireland              1
16         Hungary              1
17         Finland              1
18         Denmark              1
19           Chile              1
20         Belgium              1
21         Austria              1
22       Australia              1
23       Argentina              1

In [6]:
#3. Identify the top 5 genres with the highest number of tracks. 
#Display the genre name along with the total number of tracks for each genre.
  # > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`

#Count the number of track ids and assign a new label
#Join on genreID which is present in both tables. Group by genre and order by the number of tracks

genre_track = %sql SELECT genres.Name, COUNT(tracks.Trackid) AS Num_Tracks \
FROM genres \
JOIN tracks ON genres.Genreid=tracks.Genreid \
GROUP BY genres.Name \
ORDER BY COUNT(tracks.Trackid) \
DESC Limit 5;
display(genre_track)

Done.

                 Name  Num_Tracks
0                Rock        1297
1               Latin         579
2               Metal         374
3  Alternative & Punk         332
4                Jazz         130

In [7]:
#4. Determine the average invoice total for each customer, 
#considering both the album and individual track purchases. 
#Display the customer's first and last name along with the average invoice total. 
#Order the results by the average invoice total in descending order.
   #> Operations: `SELECT`, `AVG`, `JOIN`, `GROUP BY`, `ORDER BY`

#I decided to round the average invoice total to 2 decimal places

avg_invoice = %sql SELECT ROUND(AVG(invoices.Total),2) AS AverageInvoiceTotal, customers.FirstName, customers.LastName \
FROM customers \
JOIN invoices ON customers.CustomerId=invoices.CustomerId \
GROUP BY customers.FirstName, customers.LastName \
ORDER BY AverageInvoiceTotal DESC;

display (avg_invoice)

Done.

    AverageInvoiceTotal  FirstName      LastName
0                  7.09     Helena          Holý
1                  6.80    Richard    Cunningham
2                  6.66       Luis         Rojas
3                  6.52       Hugh      O'Reilly
4                  6.52   Ladislav        Kovács
5                  6.23      Frank       Ralston
6                  6.23       Fynn    Zimmermann
7                  6.23      Julia       Barnett
8                  6.11       Puja    Srivastava
9                  6.09     Astrid        Gruber
10                 6.09     Victor       Stevens
11                 5.95      Terhi    Hämäläinen
12                 5.80  František   Wichterlová
13                 5.80   Isabelle       Mercier
14                 5.80   Johannes  Van der Berg
15                 5.66      Bjørn        Hansen
16                 5.66        Dan        Miller
17                 5.66   François      Tremblay
18                 5.66    Heather       Leacock
19                 5.66       Jack         Smith
20                 5.66       João     Fernandes
21                 5.66       Luís     Gonçalves
22                 5.66      Wyatt        Girard
23                 5.52    Camille       Bernard
24                 5.52  Dominique      Lefebvre
25                 5.52   Jennifer      Peterson
26                 5.52     Joakim     Johansson
27                 5.52      Manoj        Pareek
28                 5.52        Tim         Goyer
29                 5.37      Aaron      Mitchell
30                 5.37  Alexandre         Rocha
31                 5.37       Daan       Peeters
32                 5.37      Diego     Gutiérrez
33                 5.37    Eduardo       Martins
34                 5.37     Edward       Francis
35                 5.37      Ellie      Sullivan
36                 5.37       Emma         Jones
37                 5.37    Enrique         Muñoz
38                 5.37   Fernanda         Ramos
39                 5.37      Frank        Harris
40                 5.37     Hannah     Schneider
41                 5.37       John        Gordon
42                 5.37       Kara       Nielsen
43                 5.37      Kathy         Chase
44                 5.37     Leonie        Köhler
45                 5.37      Lucas       Mancini
46                 5.37   Madalena       Sampaio
47                 5.37       Marc        Dubois
48                 5.37       Mark       Philips
49                 5.37       Mark        Taylor
50                 5.37     Martha          Silk
51                 5.37   Michelle        Brooks
52                 5.37     Niklas      Schröder
53                 5.37    Patrick          Gray
54                 5.37       Phil        Hughes
55                 5.37     Robert         Brown
56                 5.37    Roberto       Almeida
57                 5.37  Stanisław        Wójcik
58                 5.37      Steve        Murray

In [8]:
#5. Identify the customer who spent the most on music purchases. 
#Display the customer's first and last name, 
#along with the total amount spent.
   #> Operations: `SELECT`, `SUM`, `JOIN`, `GROUP BY`, `ORDER BY`, `LIMIT`


cust_pay = %sql SELECT SUM(invoice_items.UnitPrice * invoice_items.Quantity) AS Total_cost, customers.FirstName, customers.LastName \
FROM customers \
JOIN invoices ON customers.CustomerId = invoices.CustomerId \
JOIN invoice_items ON invoices.InvoiceId = invoice_items.InvoiceId \
GROUP BY customers.FirstName, customers.LastName \
ORDER BY Total_cost DESC LIMIT 1;

display(cust_pay)

Done.

   Total_cost FirstName LastName
0       49.62    Helena     Holý